text/Part2_2.org
#+LANGUAGE: en
#+TITLE: Теория информации, решения задач части 2 (14-16) (линейные коды)
#+AUTHOR: Волхов Михаил, M4139

* 2.14 Радиус покрытия
  Итак, задача состоит в том чтобы подсчитать радиус покрытия кодов из
  задания 2.1 и определить, можно ли их улучшить (опираясь на леммы о
  радиусе покрытия). Код, подсчитывающий радиус, приведен в
  приложении 1. Для каждого вектора $v_1$ длины $n$ он декодирует его
  в $v_2$, затем считает между ними вес и выводит
  максимальный. Проанализируем результаты, полученные на матрицах $H_1
  \ldots H_5$ ($H_6$ не существует, но улучшить код $(6,6)$, очевидно,
  нельзя, поэтому опустим его анализ).

  Итак, матрицы:
  \begin{align*}
  H_1 =
  \begin{pmatrix}
  1 & 0 & 0 & 0 & 0 & 1\\
  0 & 1 & 0 & 0 & 0 & 1\\
  0 & 0 & 1 & 0 & 0 & 1\\
  0 & 0 & 0 & 1 & 0 & 1\\
  0 & 0 & 0 & 0 & 1 & 1
  \end{pmatrix}

  H_2 =
  \begin{pmatrix}
  1 & 0 & 0 & 0 & 1 & 1\\
  0 & 1 & 0 & 0 & 0 & 1\\
  0 & 0 & 1 & 0 & 1 & 0\\
  0 & 0 & 0 & 1 & 1 & 1\\
  \end{pmatrix}
  \end{align*}

  \begin{align*}
  H_3 =
  \begin{pmatrix}
  1 & 0 & 0 & 1 & 0 & 1\\
  0 & 1 & 0 & 1 & 1 & 0\\
  0 & 0 & 1 & 0 & 1 & 1\\
  \end{pmatrix}

  H_4 =
  \begin{pmatrix}
  1 & 1 & 1 & 1 & 1 & 1\\
  1 & 0 & 0 & 0 & 0 & 0\\
  \end{pmatrix}

  H_5 =
  \begin{pmatrix}
  1 & 1 & 1 & 1 & 1 & 1\\
  \end{pmatrix}
  \end{align*}

  Сводная таблица характеристик (для кода $C$ вектора $v_1 \notin C$ и
  $v_2 \in C$ -- те, на которых достигается максимальная дистанция):

  #+ATTR_HTML: :border 2 :rules all :frame border :style line-height: 7px; width: 100%;
  | ix  | n | k | r | d | ρ |    v_1 |    v_2 |
  |-----+---+---+---+---+---+--------+--------|
  | H_1 | 6 | 1 | 5 | 6 | 3 | 111000 | 111111 |
  | H_2 | 6 | 2 | 4 | 4 | 3 | 111000 | 110101 |
  | H_3 | 6 | 3 | 3 | 3 | 2 | 111111 | 110011 |
  | H_4 | 6 | 4 | 2 | 2 | 2 | 111111 | 011110 |
  | H_5 | 6 | 5 | 1 | 1 | 1 | 111110 | 111111 |

  Свойства радиуса покрытия таковы, что если $ρ > d$, то $k$ можно
  увеличить без уменьшения $d$. В то же время $ρ ≤ r$. Отсюда следует,
  что для первого кода ($r < d$) улучшение невозможно в принципе. Для
  кодов 4 и 5 верно $ρ = d$, улучшение также невозможно. Оптимальность
  $H_2$ и $H_3$ очевидна и была доказана ранее в 2.1.
* 2.15 Декодирование по соседям нулевого слова
  Код реализованного алгоритма находится в приложении 2. Он использует
  перебор по всем комбинациям векторов кодовых слов, начиная с
  малых. Альтернативная реализация (закомментирована в приложении)
  использует предпосылку о том, что множество $Z$ можно найти жадно,
  убирая по элементу из множества всех векторов длины $n$. Насколько
  показали даннные, оба метода выдают один и тот же результат, но я не
  берусь доказывать корректность второго подхода.

  Итак, в $i$й строке расположен $Z$ для $H_i$.
  #+BEGIN_SRC
  [111111]
  [011011,101110,110101]
  [000111,011010,011101,101001,101110,110100]
  [000011,000101,001001,010001]
  [000011,000101,001001,010001,100001]
  #+END_SRC

  В приложении также приведены данные о том, какие слова входят в код,
  о решающей и ближайшей окрестности нуля (для того, чтобы убедиться в
  верности полученных данных).

  Алгоритм декодирования по соседям нулевого слова является типичным
  примером оптимизации предподсчета -- мы снижаем асимптотику запроса
  засчет некоторых готовых данных (в нашем случае $Z$).

  Наивное декодирование по кодовым словам работает за $O(2^n)$.
  Декодирование перебором по комбинациям векторов ошибок (и его
  оптимизация синдромное декодирование) имеет сложность $O(2^r)$
  (предподсчета, реальное время ответа на запрос -- $O(1)$, если
  считать операици умножения на матрицу базовыми).

  Декодирование по соседям нулевого слова занимает достаточно много
  времени на предподсчет -- наивное вычисление $Z$ предполагает O(2^n)
  итераций проверки "можно ли не включать этот вектор в $Z$". Также,
  сама проверка достаточно дорогостоящая -- она предполагает
  вычисление решающей области очередного кодового слова (конечно, это
  тоже можно предподсчитать). Асимптотика ответа на запрос хорошо и
  наглядно описана в параграфе 2.6.2, и (практически цитируя), начиная
  со скорости $R = 0.1887$ декодирование по соседям нулевого слова
  становится гораздо более эффективным чем предыдущие два метода. Для
  всех кодов кроме $(6,1)$ скорость $R$ выше этой границы.
* 2.16 Декодирование по информационным совокупностям
  Будем проверять все комбинации размера 4 строк $G$ на линейную
  независимость. Код в приложении 3. Для начала найдем $G$ кода
  Хэмминга (7,4):

  \begin{align*}
  H_1 =
  \begin{pmatrix}
  0 & 0 & 0 & 1 & 1 & 1 & 1 \\
  0 & 1 & 1 & 0 & 0 & 1 & 1 \\
  1 & 0 & 1 & 0 & 1 & 0 & 1
  \end{pmatrix}
  ,
  G_1 =
  \begin{pmatrix}
  0 & 0 & 0 & 1 & 1 & 1 & 1 \\
  0 & 1 & 1 & 0 & 0 & 1 & 1 \\
  1 & 0 & 1 & 0 & 1 & 0 & 1 \\
  0 & 0 & 1 & 0 & 1 & 1 & 0
  \end{pmatrix}
  \end{align*}

  Алгоритм выдал для нее 28 (из 35 возмжоных) наборов ЛНЗ столбцов, то
  есть количество информационных совокупностей.

  \begin{align*}
  H2 =
  \begin{pmatrix}
  0 & 0 & 0 & 0 & 1 & 1 & 1 & 1 \\
  0 & 0 & 1 & 1 & 0 & 0 & 1 & 1 \\
  0 & 1 & 0 & 1 & 0 & 1 & 0 & 1 \\
  1 & 1 & 1 & 1 & 1 & 1 & 1 & 1
  \end{pmatrix}
  ,
  G2 =
  \begin{pmatrix}
  0 & 0 & 0 & 0 & 1 & 1 & 1 & 1 \\
  0 & 0 & 1 & 1 & 0 & 0 & 1 & 1 \\
  0 & 1 & 0 & 1 & 0 & 1 & 0 & 1 \\
  1 & 0 & 0 & 1 & 0 & 1 & 1 & 0
  \end{pmatrix}
  \end{align*}

  Матрица G2 имеет 56 (из 70 возможных) информационных совокупностей.

  Опять-таки, ссылаясь на доказательства в главе 2.6.3, декодирование
  по информационным совокупностям будет быстрее для любого $R$, так
  как асимптотическая оценка показателя сложности декодирования строго
  меньше, чем у всех рассмотренных ранее способов декодирования.
