text/Part2_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-21 Tue 07:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Теория информации, решения задач части 2 (14-16) (линейные коды)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Волхов Михаил, M4139" />
</head>
<body>
<div id="content">
<h1 class="title">Теория информации, решения задач части 2 (14-16) (линейные коды)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9723a9e">1. 2.14 Радиус покрытия</a></li>
<li><a href="#orgbd728c2">2. 2.15 Декодирование по соседям нулевого слова</a></li>
<li><a href="#orgfd49ebc">3. 2.16 Декодирование по информационным совокупностям</a></li>
<li><a href="#org6605cc1">4. Приложение 1</a></li>
<li><a href="#org4153a7a">5. Приложение 2</a></li>
<li><a href="#org75acf77">6. Приложение 3</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9723a9e" class="outline-2">
<h2 id="org9723a9e"><span class="section-number-2">1</span> 2.14 Радиус покрытия</h2>
<div class="outline-text-2" id="text-1">
<p>
Итак, задача состоит в том чтобы подсчитать радиус покрытия кодов из
задания 2.1 и определить, можно ли их улучшить (опираясь на леммы о
радиусе покрытия). Код, подсчитывающий радиус, приведен в
приложении 1. Для каждого вектора \(v_1\) длины \(n\) он декодирует его
в \(v_2\), затем считает между ними вес и выводит
максимальный. Проанализируем результаты, полученные на матрицах \(H_1
  \ldots H_5\) (\(H_6\) не существует, но улучшить код \((6,6)\), очевидно,
нельзя, поэтому опустим его анализ).
</p>

<p>
Итак, матрицы:
</p>
\begin{align*}
H_1 =
\begin{pmatrix}
1 & 0 & 0 & 0 & 0 & 1\\
0 & 1 & 0 & 0 & 0 & 1\\
0 & 0 & 1 & 0 & 0 & 1\\
0 & 0 & 0 & 1 & 0 & 1\\
0 & 0 & 0 & 0 & 1 & 1
\end{pmatrix}

H_2 =
\begin{pmatrix}
1 & 0 & 0 & 0 & 1 & 1\\
0 & 1 & 0 & 0 & 0 & 1\\
0 & 0 & 1 & 0 & 1 & 0\\
0 & 0 & 0 & 1 & 1 & 1\\
\end{pmatrix}
\end{align*}

\begin{align*}
H_3 =
\begin{pmatrix}
1 & 0 & 0 & 1 & 0 & 1\\
0 & 1 & 0 & 1 & 1 & 0\\
0 & 0 & 1 & 0 & 1 & 1\\
\end{pmatrix}

H_4 =
\begin{pmatrix}
1 & 1 & 1 & 1 & 1 & 1\\
1 & 0 & 0 & 0 & 0 & 0\\
\end{pmatrix}

H_5 =
\begin{pmatrix}
1 & 1 & 1 & 1 & 1 & 1\\
\end{pmatrix}
\end{align*}

<p>
Сводная таблица характеристик (для кода \(C\) вектора \(v_1 \notin C\) и
\(v_2 \in C\) &#x2013; те, на которых достигается максимальная дистанция):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border" style="line-height: 7px; width: 100%;">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ix</th>
<th scope="col" class="org-right">n</th>
<th scope="col" class="org-right">k</th>
<th scope="col" class="org-right">r</th>
<th scope="col" class="org-right">d</th>
<th scope="col" class="org-right">ρ</th>
<th scope="col" class="org-right">v<sub>1</sub></th>
<th scope="col" class="org-right">v<sub>2</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">H<sub>1</sub></td>
<td class="org-right">6</td>
<td class="org-right">1</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">3</td>
<td class="org-right">111000</td>
<td class="org-right">111111</td>
</tr>

<tr>
<td class="org-left">H<sub>2</sub></td>
<td class="org-right">6</td>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">111000</td>
<td class="org-right">110101</td>
</tr>

<tr>
<td class="org-left">H<sub>3</sub></td>
<td class="org-right">6</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-right">111111</td>
<td class="org-right">110011</td>
</tr>

<tr>
<td class="org-left">H<sub>4</sub></td>
<td class="org-right">6</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">111111</td>
<td class="org-right">011110</td>
</tr>

<tr>
<td class="org-left">H<sub>5</sub></td>
<td class="org-right">6</td>
<td class="org-right">5</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">111110</td>
<td class="org-right">111111</td>
</tr>
</tbody>
</table>

<p>
Свойства радиуса покрытия таковы, что если \(ρ > d\), то \(k\) можно
увеличить без уменьшения \(d\). В то же время \(ρ ≤ r\). Отсюда следует,
что для первого кода (\(r < d\)) улучшение невозможно в принципе. Для
кодов 4 и 5 верно \(ρ = d\), улучшение также невозможно. Оптимальность
\(H_2\) и \(H_3\) очевидна и была доказана ранее в 2.1.
</p>
</div>
</div>
<div id="outline-container-orgbd728c2" class="outline-2">
<h2 id="orgbd728c2"><span class="section-number-2">2</span> 2.15 Декодирование по соседям нулевого слова</h2>
<div class="outline-text-2" id="text-2">
<p>
Код реализованного алгоритма находится в приложении 2. Он использует
перебор по всем комбинациям векторов кодовых слов, начиная с
малых. Альтернативная реализация (закомментирована в приложении)
использует предпосылку о том, что множество \(Z\) можно найти жадно,
убирая по элементу из множества всех векторов длины \(n\). Насколько
показали даннные, оба метода выдают один и тот же результат, но я не
берусь доказывать корректность второго подхода.
</p>

<p>
Итак, в $i$й строке расположен \(Z\) для \(H_i\).
</p>
<pre class="example">
[111111]
[011011,101110,110101]
[000111,011010,011101,101001,101110,110100]
[000011,000101,001001,010001]
[000011,000101,001001,010001,100001]
</pre>

<p>
В приложении также приведены данные о том, какие слова входят в код,
о решающей и ближайшей окрестности нуля (для того, чтобы убедиться в
верности полученных данных).
</p>

<p>
Алгоритм декодирования по соседям нулевого слова является типичным
примером оптимизации предподсчета &#x2013; мы снижаем асимптотику запроса
засчет некоторых готовых данных (в нашем случае \(Z\)).
</p>

<p>
Наивное декодирование по кодовым словам работает за \(O(2^n)\).
Декодирование перебором по комбинациям векторов ошибок (и его
оптимизация синдромное декодирование) имеет сложность \(O(2^r)\)
(предподсчета, реальное время ответа на запрос &#x2013; \(O(1)\), если
считать операици умножения на матрицу базовыми).
</p>

<p>
Декодирование по соседям нулевого слова занимает достаточно много
времени на предподсчет &#x2013; наивное вычисление \(Z\) предполагает O(2<sup>n</sup>)
итераций проверки "можно ли не включать этот вектор в \(Z\)". Также,
сама проверка достаточно дорогостоящая &#x2013; она предполагает
вычисление решающей области очередного кодового слова (конечно, это
тоже можно предподсчитать). Асимптотика ответа на запрос хорошо и
наглядно описана в параграфе 2.6.2, и (практически цитируя), начиная
со скорости \(R = 0.1887\) декодирование по соседям нулевого слова
становится гораздо более эффективным чем предыдущие два метода. Для
всех кодов кроме \((6,1)\) скорость \(R\) выше этой границы.
</p>
</div>
</div>
<div id="outline-container-orgfd49ebc" class="outline-2">
<h2 id="orgfd49ebc"><span class="section-number-2">3</span> 2.16 Декодирование по информационным совокупностям</h2>
<div class="outline-text-2" id="text-3">
<p>
Будем проверять все комбинации размера 4 строк \(G\) на линейную
независимость. Код в приложении 3. Для начала найдем \(G\) кода
Хэмминга (7,4):
</p>

\begin{align*}
G_1 =
\begin{pmatrix}
1 & 0 & 0 & 0 & 0 & 0 & 0 \\
0 & 1 & 0 & 0 & 1 & 0 & 1 \\
0 & 0 & 1 & 0 & 1 & 1 & 0 \\
0 & 0 & 0 & 1 & 1 & 1 & 1
\end{pmatrix}
\end{align*}

<p>
Алгоритм выдал для нее 16 наборов ЛНЗ столбцов, то есть количество
информационных совокупностей.
</p>

<p>
Матрица \(H\) расширенного кода Хэмминга (8,4) приведенная к
систематическому виду оказалась равной матрице \(G\):
</p>

\begin{align*}
G_2 =
\begin{pmatrix}
1 & 0 & 0 & 0 & 1 & 0 & 0 & 0 \\
0 & 1 & 0 & 0 & 0 & 1 & 0 & 0 \\
0 & 0 & 1 & 0 & 0 & 0 & 1 & 0 \\
0 & 0 & 0 & 1 & 0 & 0 & 0 & 1
\end{pmatrix}
\end{align*}

<p>
И она также имеет 16 информационных совокупностей.
</p>

<p>
Опять-таки, ссылаясь на доказательства в главе 2.6.3, декодирование
по информационным совокупностям будет быстрее для любого \(R\), так
как асимптотическая оценка показателя сложности декодирования строго
меньше, чем у всех рассмотренных ранее способов декодирования.
</p>
</div>
</div>
