text/Part2_2.org
* Приложение 1
  #+BEGIN_SRC haskell
  -- | Given matrix H, returns (r,v1,v2) -- code radius r, vector v1
  -- (not in code) and vector v2 (in code) such that w(v1-v2) = r.
  codeRadius :: [BVector] -> (Integer, BVector, BVector)
  codeRadius h =
      maximumBy (comparing $ view _1) $
      map (\y -> let d = decode y in (weight (decode y `sumBVectors` y), y, d))
          (binaryVectors $ fromIntegral n)
    where
      decode :: BVector -> BVector
      decode y = do
          let syndrom = y `vMulM` transpose h
          let e = decodeMap ! syndrom
          y `sumBVectors` e
      decodeMap = syndromDecodeBuild h
      n = length h
  #+END_SRC
