text/Part2_2.html
<div id="outline-container-org6605cc1" class="outline-2">
<h2 id="org6605cc1"><span class="section-number-2">4</span> Приложение 1</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #868B44;">--</span><span style="color: #333333;"> </span><span style="color: #868B44;">|</span><span style="color: #333333;"> </span><span style="color: #868B44;">Given</span><span style="color: #333333;"> </span><span style="color: #868B44;">matrix</span><span style="color: #333333;"> </span><span style="color: #868B44;">H,</span><span style="color: #333333;"> </span><span style="color: #868B44;">returns</span><span style="color: #333333;"> </span><span style="color: #868B44;">(r,v1,v2)</span><span style="color: #333333;"> </span><span style="color: #868B44;">--</span><span style="color: #333333;"> </span><span style="color: #868B44;">code</span><span style="color: #333333;"> </span><span style="color: #868B44;">radius</span><span style="color: #333333;"> </span><span style="color: #868B44;">r,</span><span style="color: #333333;"> </span><span style="color: #868B44;">vector</span><span style="color: #333333;"> </span><span style="color: #868B44;">v1</span>
<span style="color: #868B44;">--</span><span style="color: #333333;"> </span><span style="color: #868B44;">(not</span><span style="color: #333333;"> </span><span style="color: #868B44;">in</span><span style="color: #333333;"> </span><span style="color: #868B44;">code)</span><span style="color: #333333;"> </span><span style="color: #868B44;">and</span><span style="color: #333333;"> </span><span style="color: #868B44;">vector</span><span style="color: #333333;"> </span><span style="color: #868B44;">v2</span><span style="color: #333333;"> </span><span style="color: #868B44;">(in</span><span style="color: #333333;"> </span><span style="color: #868B44;">code)</span><span style="color: #333333;"> </span><span style="color: #868B44;">such</span><span style="color: #333333;"> </span><span style="color: #868B44;">that</span><span style="color: #333333;"> </span><span style="color: #868B44;">w(v1-v2)</span><span style="color: #333333;"> </span><span style="color: #868B44;">=</span><span style="color: #333333;"> </span><span style="color: #868B44;">r.</span>
<span style="color: #8AAFFA;">codeRadius</span><span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span>[<span style="color: #EF5C5F;">BVector</span>]<span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span>(<span style="color: #EF5C5F;">Integer</span>,<span style="color: #333333;"> </span><span style="color: #EF5C5F;">BVector</span>,<span style="color: #333333;"> </span><span style="color: #EF5C5F;">BVector</span>)
<span style="color: #8AAFFA;">codeRadius</span><span style="color: #333333;"> </span>h<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span>
<span style="color: #333333;">    </span>maximumBy<span style="color: #333333;"> </span>(comparing<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>view<span style="color: #333333;"> </span>_1)<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span>
<span style="color: #333333;">    </span>map<span style="color: #333333;"> </span>(<span style="color: #A197BF;">\</span>y<span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #FFA070;">let</span><span style="color: #333333;"> </span>d<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>decode<span style="color: #333333;"> </span>y<span style="color: #333333;"> </span><span style="color: #FFA070;">in</span><span style="color: #333333;"> </span>(weight<span style="color: #333333;"> </span>(decode<span style="color: #333333;"> </span>y<span style="color: #333333;"> </span><span style="color: #A197BF;">`sumBVectors`</span><span style="color: #333333;"> </span>y),<span style="color: #333333;"> </span>y,<span style="color: #333333;"> </span>d))
<span style="color: #333333;">        </span>(binaryVectors<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>fromIntegral<span style="color: #333333;"> </span>n)
<span style="color: #333333;">  </span><span style="color: #FFA070;">where</span>
<span style="color: #333333;">    </span>decode<span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">BVector</span><span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">BVector</span>
<span style="color: #333333;">    </span>decode<span style="color: #333333;"> </span>y<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span><span style="color: #FFA070;">do</span>
<span style="color: #333333;">        </span><span style="color: #FFA070;">let</span><span style="color: #333333;"> </span>syndrom<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>y<span style="color: #333333;"> </span><span style="color: #A197BF;">`vMulM`</span><span style="color: #333333;"> </span>transpose<span style="color: #333333;"> </span>h
<span style="color: #333333;">        </span><span style="color: #FFA070;">let</span><span style="color: #333333;"> </span>e<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>decodeMap<span style="color: #333333;"> </span><span style="color: #A197BF;">!</span><span style="color: #333333;"> </span>syndrom
<span style="color: #333333;">        </span>y<span style="color: #333333;"> </span><span style="color: #A197BF;">`sumBVectors`</span><span style="color: #333333;"> </span>e
<span style="color: #333333;">    </span>decodeMap<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>syndromDecodeBuild<span style="color: #333333;"> </span>h
<span style="color: #333333;">    </span>n<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>length<span style="color: #333333;"> </span>h
</pre>
</div>
</div>
</div>
