text/Part2_2.org
* Приложение 2
  Код реализованного алгоритма нахождения множества соседей нулевого
  слова (сам алгоритм декодирования пишется тривиально в 3 строки):
  #+BEGIN_SRC haskell
  buildZeroNN :: [BVector] -> [BVector]
  buildZeroNN h =
      traceShow (map showVec d0) $
      traceShow (map showVec $ solvingArea zero) $
      fromMaybe (error "should exist") $ find zCondition $ allCombinations $ codeH h
    where
  -- -- Eager calculation.
  --    kickWhilePossible $ delete zero $ codeH h
  --  where
  --    kickWhilePossible :: [BVector] -> [BVector]
  --    kickWhilePossible zCandidate =
  --        case find (\e -> zCondition $ delete e zCandidate) zCandidate of
  --            Just x  -> kickWhilePossible (delete x zCandidate)
  --            Nothing -> zCandidate
      zCondition :: [BVector] -> Bool
      zCondition zCandidate =
          let union = HS.fromList $ concat $ map solvingArea zCandidate
          in all (`HS.member` union) d0

      n = length h

      zero = replicate n False
      d0 = neighborhood $ solvingArea zero

      solvingArea :: BVector -> [BVector]
      solvingArea a = filter ((== a) . decode) $ binaryVectors n

      -- decoding
      syndromMap = syndromDecodeBuild h
      decode :: BVector -> BVector
      decode y = do
          let syndrom = y `vMulM` transpose h
          let e = syndromMap ! syndrom
          y `sumBVectors` e

      -- Calculates closest neighborhood by solving area
      neighborhood :: [BVector] -> [BVector]
      neighborhood sA = filter (\x -> x `notElem` sA && invertedIn x)
                                (binaryVectors (length $ unsafeHead sA))
        where
          invertedIn x =
              let invertedSet =
                      mapMaybe (\i -> if x !! i then Just (x & ix i .~ False) else Nothing)
                               [0..length x-1]
              in any (`elem` sA) invertedSet
  #+END_SRC

  Промежуточные данные для $H_1 \ldots H_5$: $C$, решающая область
  нуля и ближайшая окрестность нуля:

  #+BEGIN_SRC
  H1:
  [000000,111111]
  [000000,000001,000010,000011,000100,000101,000110,000111,001000,001001,001010,
   001011,001100,001101,001110,010000,010001,010010,010011,010100,010101,010110,
   011000,011001,011010,011100,100000,100001,100010,100100,101000,110000]
  [001111,010111,011011,011101,011110,100011,100101,100110,100111,101001,101010,
   101011,101100,101101,101110,110001,110010,110011,110100,110101,110110,111000,
   111001,111010,111100]

  H2:
  [000000,011011,101110,110101]
  [000000,000001,000010,000011,000100,000101,000110,000111,001000,001001,001010,
   001100,001101,010000,010100,100000]
  [001011,001110,001111,010001,010010,010011,010101,010110,010111,011000,011001,
   011010,011100,011101,100001,100010,100011,100100,100101,100110,100111,101000,
   101001,101010,101100,101101,110000,110100]

  H3:
  [000000,000111,011010,011101,101001,101110,110011,110100]
  [000000,000001,000010,000100,001000,001100,010000,100000]
  [000011,000101,000110,001001,001010,001101,001110,010001,010010,010100,011000,
   011100,100001,100010,100100,101000,101100,110000]

  H4:
  [000000,000011,000101,000110,001001,001010,001100,001111,010001,010010,010100,
   010111,011000,011011,011101,011110]
  [000000,000001,100000,100001]
  [000010,000011,000100,000101,001000,001001,010000,010001,100010,100011,100100,
   100101,101000,101001,110000,110001]

  H5:
  [000000,000011,000101,000110,001001,001010,001100,001111,010001,010010,010100,
   010111,011000,011011,011101,011110,100001,100010,100100,100111,101000,101011,
   101101,101110,110000,110011,110101,110110,111001,111010,111100,111111]
  [000000,000001]
  [000010,000011,000100,000101,001000,001001,010000,010001,100000,100001]
  #+END_SRC
