text/Part2_2.html
<div id="outline-container-org4153a7a" class="outline-2">
<h2 id="org4153a7a"><span class="section-number-2">5</span> Приложение 2</h2>
<div class="outline-text-2" id="text-5">
<p>
Код реализованного алгоритма нахождения множества соседей нулевого
слова (сам алгоритм декодирования пишется тривиально в 3 строки):
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8AAFFA;">buildZeroNN</span><span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span>[<span style="color: #EF5C5F;">BVector</span>]<span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span>[<span style="color: #EF5C5F;">BVector</span>]
<span style="color: #8AAFFA;">buildZeroNN</span><span style="color: #333333;"> </span>h<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span>
<span style="color: #333333;">    </span>traceShow<span style="color: #333333;"> </span>(map<span style="color: #333333;"> </span>showVec<span style="color: #333333;"> </span>d0)<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span>
<span style="color: #333333;">    </span>traceShow<span style="color: #333333;"> </span>(map<span style="color: #333333;"> </span>showVec<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>solvingArea<span style="color: #333333;"> </span>zero)<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span>
<span style="color: #333333;">    </span>fromMaybe<span style="color: #333333;"> </span>(error<span style="color: #333333;"> </span><span style="color: #868B44;">"should</span><span style="color: #333333;"> </span><span style="color: #868B44;">exist"</span>)<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>find<span style="color: #333333;"> </span>zCondition<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>allCombinations<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>codeH<span style="color: #333333;"> </span>h
<span style="color: #333333;">  </span><span style="color: #FFA070;">where</span>
<span style="color: #637579;">--</span><span style="color: #333333;"> </span><span style="color: #637579;">--</span><span style="color: #333333;"> </span><span style="color: #637579;">Eager</span><span style="color: #333333;"> </span><span style="color: #637579;">calculation.</span>
<span style="color: #637579;">--</span><span style="color: #333333;">    </span><span style="color: #637579;">kickWhilePossible</span><span style="color: #333333;"> </span><span style="color: #637579;">$</span><span style="color: #333333;"> </span><span style="color: #637579;">delete</span><span style="color: #333333;"> </span><span style="color: #637579;">zero</span><span style="color: #333333;"> </span><span style="color: #637579;">$</span><span style="color: #333333;"> </span><span style="color: #637579;">codeH</span><span style="color: #333333;"> </span><span style="color: #637579;">h</span>
<span style="color: #637579;">--</span><span style="color: #333333;">  </span><span style="color: #637579;">where</span>
<span style="color: #637579;">--</span><span style="color: #333333;">    </span><span style="color: #637579;">kickWhilePossible</span><span style="color: #333333;"> </span><span style="color: #637579;">::</span><span style="color: #333333;"> </span><span style="color: #637579;">[BVector]</span><span style="color: #333333;"> </span><span style="color: #637579;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #637579;">[BVector]</span>
<span style="color: #637579;">--</span><span style="color: #333333;">    </span><span style="color: #637579;">kickWhilePossible</span><span style="color: #333333;"> </span><span style="color: #637579;">zCandidate</span><span style="color: #333333;"> </span><span style="color: #637579;">=</span>
<span style="color: #637579;">--</span><span style="color: #333333;">        </span><span style="color: #637579;">case</span><span style="color: #333333;"> </span><span style="color: #637579;">find</span><span style="color: #333333;"> </span><span style="color: #637579;">(\e</span><span style="color: #333333;"> </span><span style="color: #637579;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #637579;">zCondition</span><span style="color: #333333;"> </span><span style="color: #637579;">$</span><span style="color: #333333;"> </span><span style="color: #637579;">delete</span><span style="color: #333333;"> </span><span style="color: #637579;">e</span><span style="color: #333333;"> </span><span style="color: #637579;">zCandidate)</span><span style="color: #333333;"> </span><span style="color: #637579;">zCandidate</span><span style="color: #333333;"> </span><span style="color: #637579;">of</span>
<span style="color: #637579;">--</span><span style="color: #333333;">            </span><span style="color: #637579;">Just</span><span style="color: #333333;"> </span><span style="color: #637579;">x</span><span style="color: #333333;">  </span><span style="color: #637579;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #637579;">kickWhilePossible</span><span style="color: #333333;"> </span><span style="color: #637579;">(delete</span><span style="color: #333333;"> </span><span style="color: #637579;">x</span><span style="color: #333333;"> </span><span style="color: #637579;">zCandidate)</span>
<span style="color: #637579;">--</span><span style="color: #333333;">            </span><span style="color: #637579;">Nothing</span><span style="color: #333333;"> </span><span style="color: #637579;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #637579;">zCandidate</span>
<span style="color: #333333;">    </span>zCondition<span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span>[<span style="color: #EF5C5F;">BVector</span>]<span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">Bool</span>
<span style="color: #333333;">    </span>zCondition<span style="color: #333333;"> </span>zCandidate<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span>
<span style="color: #333333;">        </span><span style="color: #FFA070;">let</span><span style="color: #333333;"> </span>union<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>HS.fromList<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>concat<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>map<span style="color: #333333;"> </span>solvingArea<span style="color: #333333;"> </span>zCandidate
<span style="color: #333333;">        </span><span style="color: #FFA070;">in</span><span style="color: #333333;"> </span>all<span style="color: #333333;"> </span>(<span style="color: #A197BF;">`HS.member`</span><span style="color: #333333;"> </span>union)<span style="color: #333333;"> </span>d0

<span style="color: #333333;">    </span>n<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>length<span style="color: #333333;"> </span>h

<span style="color: #333333;">    </span>zero<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>replicate<span style="color: #333333;"> </span>n<span style="color: #333333;"> </span><span style="color: #EF5C5F;">False</span>
<span style="color: #333333;">    </span>d0<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>neighborhood<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>solvingArea<span style="color: #333333;"> </span>zero

<span style="color: #333333;">    </span>solvingArea<span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">BVector</span><span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span>[<span style="color: #EF5C5F;">BVector</span>]
<span style="color: #333333;">    </span>solvingArea<span style="color: #333333;"> </span>a<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>filter<span style="color: #333333;"> </span>((<span style="color: #A197BF;">==</span><span style="color: #333333;"> </span>a)<span style="color: #333333;"> </span><span style="color: #A197BF;">.</span><span style="color: #333333;"> </span>decode)<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>binaryVectors<span style="color: #333333;"> </span>n

<span style="color: #333333;">    </span><span style="color: #637579;">--</span><span style="color: #333333;"> </span><span style="color: #637579;">decoding</span>
<span style="color: #333333;">    </span>syndromMap<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>syndromDecodeBuild<span style="color: #333333;"> </span>h
<span style="color: #333333;">    </span>decode<span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">BVector</span><span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">BVector</span>
<span style="color: #333333;">    </span>decode<span style="color: #333333;"> </span>y<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span><span style="color: #FFA070;">do</span>
<span style="color: #333333;">        </span><span style="color: #FFA070;">let</span><span style="color: #333333;"> </span>syndrom<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>y<span style="color: #333333;"> </span><span style="color: #A197BF;">`vMulM`</span><span style="color: #333333;"> </span>transpose<span style="color: #333333;"> </span>h
<span style="color: #333333;">        </span><span style="color: #FFA070;">let</span><span style="color: #333333;"> </span>e<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>syndromMap<span style="color: #333333;"> </span><span style="color: #A197BF;">!</span><span style="color: #333333;"> </span>syndrom
<span style="color: #333333;">        </span>y<span style="color: #333333;"> </span><span style="color: #A197BF;">`sumBVectors`</span><span style="color: #333333;"> </span>e

<span style="color: #333333;">    </span><span style="color: #637579;">--</span><span style="color: #333333;"> </span><span style="color: #637579;">Calculates</span><span style="color: #333333;"> </span><span style="color: #637579;">closest</span><span style="color: #333333;"> </span><span style="color: #637579;">neighborhood</span><span style="color: #333333;"> </span><span style="color: #637579;">by</span><span style="color: #333333;"> </span><span style="color: #637579;">solving</span><span style="color: #333333;"> </span><span style="color: #637579;">area</span>
<span style="color: #333333;">    </span>neighborhood<span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span>[<span style="color: #EF5C5F;">BVector</span>]<span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span>[<span style="color: #EF5C5F;">BVector</span>]
<span style="color: #333333;">    </span>neighborhood<span style="color: #333333;"> </span>sA<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>filter<span style="color: #333333;"> </span>(<span style="color: #A197BF;">\</span>x<span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span>x<span style="color: #333333;"> </span><span style="color: #A197BF;">`notElem`</span><span style="color: #333333;"> </span>sA<span style="color: #333333;"> </span><span style="color: #A197BF;">&amp;&amp;</span><span style="color: #333333;"> </span>invertedIn<span style="color: #333333;"> </span>x)
<span style="color: #333333;">                              </span>(binaryVectors<span style="color: #333333;"> </span>(length<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>unsafeHead<span style="color: #333333;"> </span>sA))
<span style="color: #333333;">      </span><span style="color: #FFA070;">where</span>
<span style="color: #333333;">        </span>invertedIn<span style="color: #333333;"> </span>x<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span>
<span style="color: #333333;">            </span><span style="color: #FFA070;">let</span><span style="color: #333333;"> </span>invertedSet<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span>
<span style="color: #333333;">                    </span>mapMaybe<span style="color: #333333;"> </span>(<span style="color: #A197BF;">\</span>i<span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #FFA070;">if</span><span style="color: #333333;"> </span>x<span style="color: #333333;"> </span><span style="color: #A197BF;">!!</span><span style="color: #333333;"> </span>i<span style="color: #333333;"> </span><span style="color: #FFA070;">then</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">Just</span><span style="color: #333333;"> </span>(x<span style="color: #333333;"> </span><span style="color: #A197BF;">&amp;</span><span style="color: #333333;"> </span>ix<span style="color: #333333;"> </span>i<span style="color: #333333;"> </span><span style="color: #A197BF;">.~</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">False</span>)<span style="color: #333333;"> </span><span style="color: #FFA070;">else</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">Nothing</span>)
<span style="color: #333333;">                             </span>[0<span style="color: #A197BF;">..</span>length<span style="color: #333333;"> </span>x<span style="color: #A197BF;">-</span>1]
<span style="color: #333333;">            </span><span style="color: #FFA070;">in</span><span style="color: #333333;"> </span>any<span style="color: #333333;"> </span>(<span style="color: #A197BF;">`elem`</span><span style="color: #333333;"> </span>sA)<span style="color: #333333;"> </span>invertedSet
</pre>
</div>

<p>
Промежуточные данные для \(H_1 \ldots H_5\): \(C\), решающая область
нуля и ближайшая окрестность нуля:
</p>

<pre class="example">
H1:
[000000,111111]
[000000,000001,000010,000011,000100,000101,000110,000111,001000,001001,001010,
 001011,001100,001101,001110,010000,010001,010010,010011,010100,010101,010110,
 011000,011001,011010,011100,100000,100001,100010,100100,101000,110000]
[001111,010111,011011,011101,011110,100011,100101,100110,100111,101001,101010,
 101011,101100,101101,101110,110001,110010,110011,110100,110101,110110,111000,
 111001,111010,111100]

H2:
[000000,011011,101110,110101]
[000000,000001,000010,000011,000100,000101,000110,000111,001000,001001,001010,
 001100,001101,010000,010100,100000]
[001011,001110,001111,010001,010010,010011,010101,010110,010111,011000,011001,
 011010,011100,011101,100001,100010,100011,100100,100101,100110,100111,101000,
 101001,101010,101100,101101,110000,110100]

H3:
[000000,000111,011010,011101,101001,101110,110011,110100]
[000000,000001,000010,000100,001000,001100,010000,100000]
[000011,000101,000110,001001,001010,001101,001110,010001,010010,010100,011000,
 011100,100001,100010,100100,101000,101100,110000]

H4:
[000000,000011,000101,000110,001001,001010,001100,001111,010001,010010,010100,
 010111,011000,011011,011101,011110]
[000000,000001,100000,100001]
[000010,000011,000100,000101,001000,001001,010000,010001,100010,100011,100100,
 100101,101000,101001,110000,110001]

H5:
[000000,000011,000101,000110,001001,001010,001100,001111,010001,010010,010100,
 010111,011000,011011,011101,011110,100001,100010,100100,100111,101000,101011,
 101101,101110,110000,110011,110101,110110,111001,111010,111100,111111]
[000000,000001]
[000010,000011,000100,000101,001000,001001,010000,010001,100000,100001]
</pre>
</div>
</div>
