text/Part2_2.org
* Приложение 3
  Код, вычисляющий количество информационных совокупностей.

  #+BEGIN_SRC haskell
  linearDependent :: [BVector] -> Bool
  linearDependent [] = False
  linearDependent vectors
      | any (== zero) vectors = False
      | otherwise = or $ map ((== zero) . sumAll) ps
    where
      n = length $ unsafeHead vectors
      zero = replicate n False
      sumAll :: [BVector] -> BVector
      sumAll = foldr sumBVectors (replicate (length $ unsafeHead vectors) False)
      ps :: [[BVector]]
      ps = allCombinations vectors

  findGfromH :: [BVector] -> [BVector]
  findGfromH h =
      fromMaybe (error "can't happen2") $
      find (\g -> formsBasis g && givesNull g) allPossibleG
    where
      formsBasis g = not $ linearDependent $ transpose g
      givesNull g = isNullM $ g `mMulM` transpose h

      allPossibleG = combinations (fromIntegral n) $ binaryVectors k
      n = length h
      r = length $ unsafeHead h
      k = n - r

  hamming74H = drop 1 $ binaryVectors 3
  hamming74G = findGfromH hamming74H
  hammingE84H = map (++ [True]) $ binaryVectors 3
  hammingE84G = findGfromH hammingE84H

  task216 :: IO ()
  task216 = do
      let rankk k x = length $ filter (not . linearDependent) $ combinations k x
      putStrLn $ showM hamming74H
      putText "---"
      putStrLn $ showM hamming74G
      print $ rankk 4 hamming74G
      putStrLn $ showM hammingE84H
      putText "---"
      putStrLn $ showM hammingE84G
      print $ rankk 4 hammingE84G
  #+END_SRC

  Код, выч
