text/Part2_2.html
<div id="outline-container-org75acf77" class="outline-2">
<h2 id="org75acf77"><span class="section-number-2">6</span> Приложение 3</h2>
<div class="outline-text-2" id="text-6">
<p>
Код, вычисляющий количество информационных совокупностей.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8AAFFA;">linearDependent</span><span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span>[<span style="color: #EF5C5F;">BVector</span>]<span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">Bool</span>
<span style="color: #8AAFFA;">linearDependent</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">[]</span><span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">False</span>
<span style="color: #8AAFFA;">linearDependent</span><span style="color: #333333;"> </span>vectors
<span style="color: #333333;">    </span><span style="color: #A197BF;">|</span><span style="color: #333333;"> </span>any<span style="color: #333333;"> </span>(<span style="color: #A197BF;">==</span><span style="color: #333333;"> </span>zero)<span style="color: #333333;"> </span>vectors<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">False</span>
<span style="color: #333333;">    </span><span style="color: #A197BF;">|</span><span style="color: #333333;"> </span>otherwise<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>or<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>map<span style="color: #333333;"> </span>((<span style="color: #A197BF;">==</span><span style="color: #333333;"> </span>zero)<span style="color: #333333;"> </span><span style="color: #A197BF;">.</span><span style="color: #333333;"> </span>sumAll)<span style="color: #333333;"> </span>ps
<span style="color: #333333;">  </span><span style="color: #FFA070;">where</span>
<span style="color: #333333;">    </span>n<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>length<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>unsafeHead<span style="color: #333333;"> </span>vectors
<span style="color: #333333;">    </span>zero<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>replicate<span style="color: #333333;"> </span>n<span style="color: #333333;"> </span><span style="color: #EF5C5F;">False</span>
<span style="color: #333333;">    </span>sumAll<span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span>[<span style="color: #EF5C5F;">BVector</span>]<span style="color: #333333;"> </span><span style="color: #A197BF;">-&gt;</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">BVector</span>
<span style="color: #333333;">    </span>sumAll<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>foldr<span style="color: #333333;"> </span>sumBVectors<span style="color: #333333;"> </span>(replicate<span style="color: #333333;"> </span>(length<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>unsafeHead<span style="color: #333333;"> </span>vectors)<span style="color: #333333;"> </span><span style="color: #EF5C5F;">False</span>)
<span style="color: #333333;">    </span>ps<span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span>[[<span style="color: #EF5C5F;">BVector</span>]]
<span style="color: #333333;">    </span>ps<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>allCombinations<span style="color: #333333;"> </span>vectors

<span style="color: #8AAFFA;">task216</span><span style="color: #333333;"> </span><span style="color: #A197BF;">::</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">IO</span><span style="color: #333333;"> </span><span style="color: #EF5C5F;">()</span>
<span style="color: #8AAFFA;">task216</span><span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span><span style="color: #FFA070;">do</span>
<span style="color: #333333;">    </span><span style="color: #FFA070;">let</span><span style="color: #333333;"> </span>rankk<span style="color: #333333;"> </span>k<span style="color: #333333;"> </span>x<span style="color: #333333;"> </span><span style="color: #A197BF;">=</span><span style="color: #333333;"> </span>length<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>filter<span style="color: #333333;"> </span>(not<span style="color: #333333;"> </span><span style="color: #A197BF;">.</span><span style="color: #333333;"> </span>linearDependent)<span style="color: #333333;"> </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>combinations<span style="color: #333333;"> </span>k<span style="color: #333333;"> </span>x
<span style="color: #333333;">    </span>print<span style="color: #333333;">  </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>rankk<span style="color: #333333;"> </span>4<span style="color: #333333;"> </span>hamming74G
<span style="color: #333333;">    </span>print<span style="color: #333333;">  </span><span style="color: #A197BF;">$</span><span style="color: #333333;"> </span>rankk<span style="color: #333333;"> </span>4<span style="color: #333333;"> </span>hamming84G
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Волхов Михаил, M4139</p>
<p class="date">Created: 2017-11-21 Tue 07:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
